## Plan Result (prod_enterprise)




<pre><code>Plan: 744 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_storage_container.sc




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["CRIME-ADO-POC"].azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "cef8dd15315775bcde240kv"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "azure-control-prod-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Crime"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                     = (known after apply)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_key_vault_access_policy.permissions will be created
  + resource "azurerm_key_vault_access_policy" "permissions" {
      + certificate_permissions = [
          + "Backup",
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "ManageContacts",
          + "ManageIssuers",
          + "Recover",
          + "Restore",
          + "SetIssuers",
          + "Update",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Backup",
          + "Create",
          + "Decrypt",
          + "Delete",
          + "Encrypt",
          + "Get",
          + "Import",
          + "List",
          + "Recover",
          + "Restore",
          + "Sign",
          + "UnwrapKey",
          + "Update",
          + "Verify",
          + "WrapKey",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "5cd4570c-c9eb-4892-b368-f23a96f16cb5"
      + secret_permissions      = [
          + "Get",
          + "Set",
          + "List",
          + "Delete",
          + "Restore",
          + "Recover",
          + "Backup",
        ]
      + storage_permissions     = [
          + "Backup",
          + "Delete",
          + "DeleteSAS",
          + "Get",
          + "GetSAS",
          + "List",
          + "ListSAS",
          + "Recover",
          + "RegenerateKey",
          + "Restore",
          + "Set",
          + "SetSAS",
          + "Update",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_key_vault_secret.aks_admin_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "aks-admin-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_key_vault_secret.aks_user_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_user_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "aks-user-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_key_vault_secret.sp_app_id will be created
  + resource "azurerm_key_vault_secret" "sp_app_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-application-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_key_vault_secret.sp_object_id will be created
  + resource "azurerm_key_vault_secret" "sp_object_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-object-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_key_vault_secret.sp_token will be created
  + resource "azurerm_key_vault_secret" "sp_token" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_role_assignment.local_role_assignments["Key Vault Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5cd4570c-c9eb-4892-b368-f23a96f16cb5"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_role_assignment.local_role_assignments["Storage Account Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5cd4570c-c9eb-4892-b368-f23a96f16cb5"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_role_assignment.local_role_assignments["Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5cd4570c-c9eb-4892-b368-f23a96f16cb5"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_storage_account.sa will be created
  + resource "azurerm_storage_account" "sa" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "cef8dd15315775bcde240sa"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "azure-control-prod-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Crime"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = true

          + delete_retention_policy {
              + days = 30
            }
        }
    }

  # module.subscription["CRIME-ADO-POC"].azurerm_storage_container.sc will be created
  + resource "azurerm_storage_container" "sc" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "subscription-tfstate"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "cef8dd15315775bcde240sa"
    }

  # module.subscription["DCD-AWS-Migration"].azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "c58a2ce36d164aa559c68kv"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "azure-control-prod-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                     = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azurerm_key_vault_access_policy.permissions will be created
  + resource "azurerm_key_vault_access_policy" "permissions" {
      + certificate_permissions = [
          + "Backup",
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "ManageContacts",
          + "ManageIssuers",
          + "Recover",
          + "Restore",
          + "SetIssuers",
          + "Update",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Backup",
          + "Create",
          + "Decrypt",
          + "Delete",
          + "Encrypt",
          + "Get",
          + "Import",
          + "List",
          + "Recover",
          + "Restore",
          + "Sign",
          + "UnwrapKey",
          + "Update",
          + "Verify",
          + "WrapKey",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "d6f9ccd9-b308-4260-9f3c-b0faf36b2e57"
      + secret_permissions      = [
          + "Get",
          + "Set",
          + "List",
          + "Delete",
          + "Restore",
          + "Recover",
          + "Backup",
        ]
      + storage_permissions     = [
          + "Backup",
          + "Delete",
          + "DeleteSAS",
          + "Get",
          + "GetSAS",
          + "List",
          + "ListSAS",
          + "Recover",
          + "RegenerateKey",
          + "Restore",
          + "Set",
          + "SetSAS",
          + "Update",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.subscription["DCD-AWS-Migration"].azurerm_key_vault_secret.aks_admin_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "aks-admin-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azurerm_key_vault_secret.aks_user_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_user_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "aks-user-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azurerm_key_vault_secret.sp_app_id will be created
  + resource "azurerm_key_vault_secret" "sp_app_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-application-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azurerm_key_vault_secret.sp_object_id will be created
  + resource "azurerm_key_vault_secret" "sp_object_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-object-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azurerm_key_vault_secret.sp_token will be created
  + resource "azurerm_key_vault_secret" "sp_token" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azurerm_role_assignment.local_role_assignments["Key Vault Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d6f9ccd9-b308-4260-9f3c-b0faf36b2e57"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azurerm_role_assignment.local_role_assignments["Storage Account Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d6f9ccd9-b308-4260-9f3c-b0faf36b2e57"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-AWS-Migration"].azurerm_role_assignment.local_role_assignments["Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d6f9ccd9-b308-4260-9f3c-b0faf36b

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

(known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_key_vault_secret.sp_token will be created
  + resource "azurerm_key_vault_secret" "sp_token" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_role_assignment.local_role_assignments["Key Vault Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "13d33eb1-60a7-4d50-878b-0625081bcf66"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_role_assignment.local_role_assignments["Storage Account Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "13d33eb1-60a7-4d50-878b-0625081bcf66"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_role_assignment.local_role_assignments["Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "13d33eb1-60a7-4d50-878b-0625081bcf66"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_storage_account.sa will be created
  + resource "azurerm_storage_account" "sa" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "ced302caf85731c3ce90esa"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "azure-control-mgmt-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = true

          + delete_retention_policy {
              + days = 30
            }
        }
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_storage_container.sc will be created
  + resource "azurerm_storage_container" "sc" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "subscription-tfstate"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "ced302caf85731c3ce90esa"
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "c705b273195f157f0a347kv"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "azure-control-dev-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                     = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_key_vault_access_policy.permissions will be created
  + resource "azurerm_key_vault_access_policy" "permissions" {
      + certificate_permissions = [
          + "Backup",
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "ManageContacts",
          + "ManageIssuers",
          + "Recover",
          + "Restore",
          + "SetIssuers",
          + "Update",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Backup",
          + "Create",
          + "Decrypt",
          + "Delete",
          + "Encrypt",
          + "Get",
          + "Import",
          + "List",
          + "Recover",
          + "Restore",
          + "Sign",
          + "UnwrapKey",
          + "Update",
          + "Verify",
          + "WrapKey",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "426d48dc-2cac-439f-a3ea-1f8acf3f49e7"
      + secret_permissions      = [
          + "Get",
          + "Set",
          + "List",
          + "Delete",
          + "Restore",
          + "Recover",
          + "Backup",
        ]
      + storage_permissions     = [
          + "Backup",
          + "Delete",
          + "DeleteSAS",
          + "Get",
          + "GetSAS",
          + "List",
          + "ListSAS",
          + "Recover",
          + "RegenerateKey",
          + "Restore",
          + "Set",
          + "SetSAS",
          + "Update",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_key_vault_secret.aks_admin_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "aks-admin-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_key_vault_secret.aks_user_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_user_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "aks-user-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_key_vault_secret.sp_app_id will be created
  + resource "azurerm_key_vault_secret" "sp_app_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-application-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_key_vault_secret.sp_object_id will be created
  + resource "azurerm_key_vault_secret" "sp_object_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-object-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_key_vault_secret.sp_token will be created
  + resource "azurerm_key_vault_secret" "sp_token" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_role_assignment.local_role_assignments["Key Vault Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "426d48dc-2cac-439f-a3ea-1f8acf3f49e7"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_role_assignment.local_role_assignments["Storage Account Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "426d48dc-2cac-439f-a3ea-1f8acf3f49e7"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_role_assignment.local_role_assignments["Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "426d48dc-2cac-439f-a3ea-1f8acf3f49e7"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_storage_account.sa will be created
  + resource "azurerm_storage_account" "sa" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "c705b273195f157f0a347sa"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "azure-control-dev-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = true

          + delete_retention_policy {
              + days = 30
            }
        }
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_storage_container.sc will be created
  + resource "azurerm_storage_container" "sc" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "subscription-tfstate"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "c705b273195f157f0a347sa"
    }

Plan: 744 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":91,"Program":"tfcmt","SHA1":"","Target":"prod_enterprise","Vars":{}} -->